Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийКассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПаспортист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяКонтрагентовДляСубсидийИЛьгот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентЛьгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЛьгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентРегиональнаяСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорРегиональнаяСубсидия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОСМДСервер/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

// Позволяет определить есть ли среди реквизитов шапки документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеДокумента) Экспорт
	
	Возврат НЕ (МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено);
	
КонецФункции // ЕстьРеквизитДокумента()

// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина".
//
// Параметры:
//  ТекстСообщения - строка, текст сообщения.
//  Отказ          - булево, признак отказа (необязательный).
//
Процедура СообщитьОбОшибке(ТекстСообщения, ДокОбъект, Отказ = Ложь, Поле = "", ПутьКДанным = "") Экспорт
	
	Отказ = Истина;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокОбъект, Поле, ПутьКДанным, Отказ);
	
КонецПроцедуры

// Генерирует уникальный идентификатор.
//
// Параметры
//
// Возвращаемое значение:
//  Строка – сформированный уникальный идентификатор.
//
Функция СгенерироватьИдентификатор(ДопЧисло = 0, ДлинаИдентификатора = 0, СоставИдентификатора = "") Экспорт
	
	Если ДлинаИдентификатора = 0 Тогда
		ДлинаИдентификатора = 4;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	ТекСлучайноеЧисло = ТекущаяУниверсальнаяДатаВМиллисекундах() + ДопЧисло;
	ТекстИдентификатора = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекСлучайноеЧисло);
	
	МассивНаборов = Новый Массив;
	
	Если СтрДлина(СоставИдентификатора) = 0 Тогда
		МассивНаборов.Добавить("ABCDEFGHIJKLM");
		МассивНаборов.Добавить("0123456789");
		МассивНаборов.Добавить("NOPQRSTUVWXYZ");
	Иначе
		СоставИдентификатора = СоставИдентификатора + ",";	
		Если Найти(СоставИдентификатора, "ВР,") > 0 Тогда
			МассивНаборов.Добавить("ABCDEFGHIJKLM");
			МассивНаборов.Добавить("NOPQRSTUVWXYZ");
			СоставИдентификатора = СтрЗаменить(СоставИдентификатора, "ВР,", "");
		КонецЕсли;
		Если Найти(СоставИдентификатора, "Цифры,") > 0 Тогда
			МассивНаборов.Добавить("0123456789");
			СоставИдентификатора = СтрЗаменить(СоставИдентификатора, "Цифры,", "");
		КонецЕсли;
		Если Найти(СоставИдентификатора, "НР,") > 0 Тогда
			МассивНаборов.Добавить("abcdefghijklm");
			МассивНаборов.Добавить("nopqrstuvwxyz");
			СоставИдентификатора = СтрЗаменить(СоставИдентификатора, "НР,", "");
		КонецЕсли;
		
	КонецЕсли;
	
	КолМассивНаборов = МассивНаборов.Количество();
	
	УпМассивНаборов = Новый Массив(КолМассивНаборов);
	
	тмМаксИндекс = КолМассивНаборов - 1;
	Для Индекс = 0 По КолМассивНаборов - 1 Цикл
		ТекСлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, тмМаксИндекс);
		УпМассивНаборов[Индекс] = МассивНаборов[ТекСлучайноеЧисло];
		МассивНаборов.Удалить(ТекСлучайноеЧисло);
		тмМаксИндекс = тмМаксИндекс - 1;
	КонецЦикла;
	
	ТекИндекс = 0;
	Для Сч = 1 По ДлинаИдентификатора Цикл
		ТекНабор = УпМассивНаборов[ТекИндекс];
		ТекСлучайноеЧисло = ГСЧ.СлучайноеЧисло(1, СтрДлина(ТекНабор));
		ТекстИдентификатора = ТекстИдентификатора + Сред(ТекНабор, ТекСлучайноеЧисло, 1);
		Если ТекИндекс < КолМассивНаборов - 1 Тогда
			ТекИндекс = ТекИндекс + 1;
		Иначе
			ТекИндекс = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстИдентификатора;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ШАПКИ ДОКУМЕНТА

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ПриСозданииНаСервере" в модулях форм всех документов.
//
// Параметры:
//  ДокументОбъект                 - объект редактируемого документа,
//  ВидОперации                    - необязаетельный, строка вида операции ("Покупка" или "Продажа"),
//                                   если не передан, то реквизиты, зависящие от вида операции, не заполняются
//  ПараметрОбъектКопирования 	   - указывает что документ создан копированием
//  ПараметрОснование 			   - ссылка на документ основание
Процедура ЗаполнитьШапкуДокумента(Объект,
	ВидОперации = "",
	ПараметрЗначениеКопирования = Неопределено,
	ПараметрОснование = Неопределено,
	СостояниеДокумента,
	КартинкаСостоянияДокумента,
	РазрешеноПроведение,
	ПоследнееИзменение,
	ЗначенияЗаполнения = Неопределено) Экспорт
	
	Пользователь = Пользователи.ТекущийПользователь();
	МетаданныеДокумента = Объект.Ссылка.Метаданные();
	РазрешеноПроведение = МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = Пользователь;
		СостояниеДокумента = "Новый";
		КартинкаСостоянияДокумента = 0;
		
		Если ЕстьРеквизитДокумента("Здание", Объект.Ссылка.Метаданные()) Тогда
			Если ЗначениеЗаполнено(Объект.Здание) Тогда
				Объект.Организация = Объект.Здание.Организация;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьРеквизитДокумента("Организация", Объект.Ссылка.Метаданные()) Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
				Объект.Организация = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяОрганизация");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	Организации.Ссылка КАК ОрганизацияСсылка
				|ИЗ
				|	Справочник.Организации КАК Организации
				|";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Объект.Организация = Выборка.ОрганизацияСсылка;
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьРеквизитДокумента("БанковскийСчет", Объект.Ссылка.Метаданные()) Тогда
				Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
					Объект.БанковскийСчет = Объект.Организация.БанковскийСчетПоУмолчанию;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Если Объект.Проведен Тогда
			СостояниеДокумента = "Проведен";
			КартинкаСостоянияДокумента = 1;
		ИначеЕсли РазрешеноПроведение Тогда
			СостояниеДокумента = "Не проведен";
			КартинкаСостоянияДокумента = 0;
		Иначе
			СостояниеДокумента = "Записан";
			КартинкаСостоянияДокумента = 3;
		КонецЕсли;
		
		ПоследнееИзменение = Строка(Объект.АвторПоследнегоИзменения) + " (" +Объект.ДатаПоследнегоИзменения + ")";
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ ФИЗИЧЕСКИЕ ЛИЦА

// Функция формирует фамилию, имя и отчество одной строкой.
//
// Параметры
//  Фамилия      - фамилия физ. лица
//  Имя          - имя физ. лица
//  Отчество     - отчество физ. лица
//  ФИОКратко    - Булево - если Истина (по умолчанию), Представление физ.лица
//                 включает фамилию и инициалы, если Ложь - фамилию и полностью
//                 имя и отчество.
//
// Возвращаемое значение 
//  Фамилия, имя, отчество одной строкой.
//
Функция ПолучитьФамилиюИмяОтчество(Фамилия = " ", Имя = " ", Отчество = " ", ФИОКратко = Истина) Экспорт
	
	Если ФИОКратко Тогда
		Возврат ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + 
		?(НЕ ПустаяСтрока(Отчество) , 
		Лев(Отчество,1)+".", ""), ""), "");
	Иначе
		Возврат ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Имя + 
		?(НЕ ПустаяСтрока(Отчество) , " " + Отчество, ""), ""), "");
	КонецЕсли;
	
КонецФункции // ПолучитьФамилиюИмяОтчество()

// Функция выделяет первое слово в предложении
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫДАЧИ СООБЩЕНИЙ ОБ ОШИБКАХ ПРОВЕДЕНИЯ.

// Формирует строку представления кассы.
//
// Параметры:
//  НоменклатураПредставление - Строка - представление номенклатуры.
//  ВидУчетаТовараПредставление - Строка - представление вида номенклатуры.
//  ХарактеристикаПредставление - Строка - представление характеристики.
//  СерияПредставление - Строка - представление серии.
//  СтадияПредставление - Строка - представление захода.
//
// Возвращаемое значение:
//  Строка - строка с представлением номенклатуры.
//
Функция ПредставлениеБанковскогоСчетаКассы(БанковскийСчетКассаПредставление,
	ТипДенежныхСредствПредставление = "",
	ВалютаПредставление = "") Экспорт
	
	СтрПредставление = СокрЛП(БанковскийСчетКассаПредставление);
	
	Если ЗначениеЗаполнено(ТипДенежныхСредствПредставление)Тогда
		СтрПредставление = СтрПредставление + ", " + СокрЛП(ТипДенежныхСредствПредставление);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВалютаПредставление)Тогда
		СтрПредставление = СтрПредставление + ", " + СокрЛП(ВалютаПредставление);
	КонецЕсли;
	
	Возврат СтрПредставление;
	
КонецФункции // ПредставлениеБанковскогоСчетаКассы()

// Процедура сообщает об ошибках проведения по регистру Запасы на складах
//
Процедура СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладахСписком(ДокОбъект, ВыборкаЗаписей, Отказ) Экспорт
	
	ЗаголовокОшибки = НСтр("ru='Ошибка:';uk='Помилка:'");
	ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ru='Не хватает запасов';uk='Не вистачає запасів'");
	СообщитьОбОшибке(ТекстЗаголовкаСообщения, ДокОбъект, Отказ);
	
	ШаблонСообщения = НСтр("ru='Номенклатура: %Номенклатура%,"
		"склад %СкладПредставление%"
		"остаток до проведения %КоличествоОстаток% %ЕдиницаИзмерения%,"
		"недостаточно %Количество% %ЕдиницаИзмерения%';uk='Номенклатура: %Номенклатура%, склад %СкладПредставление% залишок до проведення %КоличествоОстаток% %ЕдиницаИзмерения%, недостатньо %Кількість% %ЕдиницаИзмерения%'");
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Номенклатура%", ВыборкаЗаписей.НоменклатураПредставление);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СкладПредставление%", ВыборкаЗаписей.СкладПредставление);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОстаток%", Строка(ВыборкаЗаписей.ОстатокЗапасыНаСкладах));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(-ВыборкаЗаписей.КоличествоОстатокЗапасыНаСкладах));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", ВыборкаЗаписей.ЕдиницаИзмеренияПредставление);
		
		СообщитьОбОшибке(ТекстСообщения, ДокОбъект, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры // СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладахСписком()

// Процедура сообщает об ошибках проведения по регистру Денежные средства.
//
Процедура СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокОбъект, ВыборкаЗаписей, Отказ) Экспорт
	
	ЗаголовокОшибки = НСтр("ru='Ошибка:';uk='Помилка:'");
	ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ru='Не хватает денежных средств';uk='Не вистачає коштів'");
	СообщитьОбОшибке(ТекстЗаголовкаСообщения, ДокОбъект, Отказ);
	
	ШаблонСообщения = НСтр("ru='%СчетКасса%: %ПредставлениеСчетаКассы%,"
		"остаток до проведения %СуммаОстаток% %Валюта%,"
		"недостаточно %Сумма% %Валюта%';uk='% СчетКасса%: %ПредставлениеСчетаКассы%, залишок до проведення %СуммаОстаток% %Валюта%, недостатньо %Сума% %Валюта%'");
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		ПредставлениеСчетаКассы = ПредставлениеБанковскогоСчетаКассы(ВыборкаЗаписей.БанковскийСчетКассаПредставление);
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%ПредставлениеСчетаКассы%", ПредставлениеСчетаКассы);
		
		Если ВыборкаЗаписей.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СчетКасса%", "Счет");
			
		Иначе
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СчетКасса%", "Касса");
			
		КонецЕсли;
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаОстаток%", Строка(ВыборкаЗаписей.ОстатокДенежныхСредств));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Сумма%", Строка(-ВыборкаЗаписей.СуммаОстаток));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Валюта%", Константы.ВалютаУчета.Получить());
		
		СообщитьОбОшибке(ТекстСообщения, ДокОбъект, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры // СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства()

// Процедура сообщает об ошибках проведения по регистру Расчеты по лицевым счетам
//
Процедура СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЛицевымСчетамСписком(ДокОбъект, ВыборкаЗаписей, Отказ) Экспорт
	
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеНаСчет") или
//{{MRG[ <-> ]
		ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеВКассу") или
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеВКассу") Тогда
//}}MRG[ <-> ]
		ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОплатаУслугМВК") Тогда
		
		ЗаголовокОшибки = НСтр("ru='Ошибка:';uk='Помилка:'");
		ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ru='Переплата';uk='Переплата'");
		СообщитьОбОшибке(ТекстЗаголовкаСообщения, ДокОбъект, Отказ);
		
		ШаблонСообщения = НСтр("ru='Услуга : %ПредставлениеУслуги%';uk='Послуга : %ПредставлениеУслуги%'");
		
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%ПредставлениеУслуги%", Строка(ВыборкаЗаписей.УслугаПредставление));
			
			СообщитьОбОшибке(ТекстСообщения, ДокОбъект, Отказ);
			
		КонецЦикла;
		
	Иначе
		ЗаголовокОшибки = НСтр("ru='Ошибка:';uk='Помилка:'");
		ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ru='Действие отменено по причине:"
			"существуют оплаты';uk='Дія скасована через: існують оплати'");
		СообщитьОбОшибке(ТекстЗаголовкаСообщения, ДокОбъект, Отказ);
		
		ШаблонСообщения = НСтр("ru='%ПредставлениеЛицевогоСчета  %ПредставлениеУслуги%';uk='%ПредставлениеЛицевогоСчета  %ПредставлениеУслуги%'");
		
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%ПредставлениеЛицевогоСчета", Строка(ВыборкаЗаписей.ЛицевойСчетПредставление));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеУслуги%", Строка(ВыборкаЗаписей.УслугаПредставление));
			
			СообщитьОбОшибке(ТекстСообщения, ДокОбъект, Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЛицевымСчетамСписком()

// Процедура сообщает об ошибках проведения по регистру Расчеты по лицевым счетам повторное начисление
//
Процедура СообщитьОбОшибкахПроведенияПоПовторномуНачислению(ДокОбъект, ВыборкаЗаписей, Отказ) Экспорт
	
	ЗаголовокОшибки = НСтр("ru='Ошибка:';uk='Помилка:'");
	ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ru='Повторное начисление';uk='Повторне нарахування'");
	СообщитьОбОшибке(ТекстЗаголовкаСообщения, ДокОбъект, Отказ);
	
	ШаблонСообщения = НСтр("ru='Документ : %ПредставлениеРегистратора%';uk='Документ : %ПредставлениеРегистратора%'");
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%ПредставлениеРегистратора%", Строка(ВыборкаЗаписей.Регистратор));
		
		СообщитьОбОшибке(ТекстСообщения, ДокОбъект, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры // СообщитьОбОшибкахПроведенияПоПовторномуНачислению()

// Процедура сообщает об ошибках проведения по регистру Расчеты по лицевым счетам повторное начисление
//
Процедура СообщитьОбОшибкахПроведенияПоРегиструСтатьиЗатратСписком(ДокОбъект, ВыборкаЗаписей, Отказ) Экспорт
	
	ЗаголовокОшибки = НСтр("ru='Ошибка:';uk='Помилка:'");
	ТекстЗаголовкаСообщения = ЗаголовокОшибки + Символы.ПС + НСтр("ru='Не выполнено закрытие месяца по зданию';uk='Не виконано закриття місяця по будинку'");
	СообщитьОбОшибке(ТекстЗаголовкаСообщения, ДокОбъект, Отказ);
	
	ШаблонСообщения = НСтр("ru='Здание : %ПредставлениеЗдания%';uk='Будинок : %ПредставлениеЗдания%'");
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%ПредставлениеЗдания%", Строка(ВыборкаЗаписей.Здание));
		
		СообщитьОбОшибке(ТекстСообщения, ДокОбъект, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры // СообщитьОбОшибкахПроведенияПоПовторномуНачислению()

// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДИНАМИЧЕСКИМИ СПИСКАМИ

// Процедура устанавливает отбор у динамического списка на равенство.
//
Процедура УстановитьОтборУДинамическогоСпискаНаРавенство(Отбор, ЛевоеЗначение, ПравоеЗначение) Экспорт
	
	ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение	 = ЛевоеЗначение;
	ЭлементОтбора.ВидСравнения	 = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
	ЭлементОтбора.Использование  = Истина;
	
КонецПроцедуры // УстановитьОтборДляДинамическогоСписка()

// Удаляет элемент отбора динамического списка
//
//Параметры:
//Список  - обрабатываемый динамический список,
//ИмяПоля - имя поля компоновки, отбор по которому нужно удалить
//
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля) Экспорт
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Счетчик = 1;
	Пока Счетчик <= Список.Отбор.Элементы.Количество() Цикл
		ЭлементОтбора = Список.Отбор.Элементы[Счетчик - 1];
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Устанавливает элемент отбор динамического списка
//
//Параметры:
//Список			- обрабатываемый динамический список,
//ИмяПоля			- имя поля компоновки, отбор по которому нужно установить,
//ВидСравнения		- вид сравнения отбора, по умолчанию - Равно,
//ПравоеЗначение 	- значение отбора
//
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено) Экспорт
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Изменяет элемент отбора динамического списка
//
//Параметры:
//Список         - обрабатываемый динамический список,
//ИмяПоля        - имя поля компоновки, отбор по которому нужно установить,
//ВидСравнения   - вид сравнения отбора, по умолчанию - Равно,
//ПравоеЗначение - значение отбора,
//Установить     - признак необходимости установить отбор
//
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено, ОтборПоПериоду = Ложь) Экспорт
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		Если ОтборПоПериоду Тогда
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		Иначе
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()


///////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Форматирует сумму прописью банковского платежного документа.
//
// Параметры:
//  Сумма        - число - реквизит, который надо представить прописью 
//  Валюта       - СправочникСсылка.Валюты - валюта, в которой нужно представить
//                 сумму
//  ВыводитьСуммуБезКопеек - булево - флаг представления суммы без копеек.
//
// Возвращаемое значение
//  Отформатированная строка.
//
Функция ФорматироватьСуммуПрописьюПлатежногоДокумента(Сумма, Валюта, ВыводитьСуммуБезКопеек = Ложь, КодЯзыка = "ru") Экспорт
	
	Результат     = Сумма;
	ЦелаяЧасть    = Цел(Сумма);
	ФорматСтрока  = "Л=" + Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыка) + "; ДП=Ложь";
	ПарамПредмета = Локализация.ПараметрыПрописи(Валюта, КодЯзыка); 
	
	Если Результат = ЦелаяЧасть Тогда
		Если ВыводитьСуммуБезКопеек Тогда
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
			Результат = Лев(Результат, Найти(Результат, "0") - 1);
		Иначе
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
		КонецЕсли;
	Иначе
		Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСуммуПрописьюПлатежногоДокумента() 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С НДС

// Возвращает строковое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
// Возвращаемое значение:
// 		Строка - Значение ставки НДС строкой
//
Функция ПолучитьСтавкуНДССтрокой(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		ЗначениеНалога = "20";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		ЗначениеНалога = "0";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		ЗначениеНалога = "Без НДС";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС") Тогда
		ЗначениеНалога = "Не НДС";
	Иначе
		ЗначениеНалога = Строка(СтавкаНДС);
	КонецЕсли;
	
	Возврат ЗначениеНалога;
	
КонецФункции // ПолучитьСтавкуНДССтрокой()

// Возвращает строковое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
// Возвращаемое значение:
// 		Строка - Значение ставки НДС строкой
//
Функция ПолучитьПоСтрокеСтавкуНДС(ЗначениеНалога) Экспорт
	
	Если ЗначениеНалога = "20" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	ИначеЕсли ЗначениеНалога = "0" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	ИначеЕсли ЗначениеНалога = "Без НДС" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС");
	КонецЕсли;
	
	Возврат СтавкаНДС;
		
КонецФункции // ПолучитьСтавкуНДССтрокой()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ПОДКЛЮЧАЕМЫМ ОБОРУДОВАНИЕМ

// Проверяет, что включена ф.о "Использовать подключаемое оборудование",
// настроено ли оборудование и авторизовался пользователь,
// а не внешний пользователь.
Функция ИспользоватьПодключаемоеОборудование() Экспорт
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	ПользовательАвторизовался = ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.Пользователи");
	ТипыПодключенногоОборудования = ПодключаемоеОборудованиеУТПовтИсп.ТипыПодключенногоОборудования();
	
	Возврат ИспользоватьПодключаемоеОборудование
		И ТипыПодключенногоОборудования <> Неопределено
		И ТипыПодключенногоОборудования.Количество() > 0;
	
КонецФункции
